Yachasoft.Sri.WebService/Resources/Yachasoft.Sri.WebService.Request.AutorizacionComprobanteLoteRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ec="http://ec.gob.sri.ws.autorizacion">
	<soapenv:Header/>
	<soapenv:Body>
		<ec:autorizacionComprobanteLote>
			<!--Optional:-->
			<claveAccesoLote>{claveAccesoLoteParameter}</claveAccesoLote>
		</ec:autorizacionComprobanteLote>
	</soapenv:Body>
</soapenv:Envelope>