Yachasoft.Sri.DocumentosElectronicos/bin/Debug/net5.0/Request/AutorizacionComprobanteRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ec="http://ec.gob.sri.ws.autorizacion">
	<soapenv:Header/>
	<soapenv:Body>
		<ec:autorizacionComprobante>
			<!--Optional:-->
			<claveAccesoComprobante>{claveAccesoParameter}</claveAccesoComprobante>
		</ec:autorizacionComprobante>
	</soapenv:Body>
</soapenv:Envelope>