apps/sri-core/test/fixtures/soap/autorizacion-envelope.golden.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ec="http://ec.gob.sri.ws.autorizacion"><soapenv:Header/><soapenv:Body><ec:autorizacionComprobante><claveAccesoComprobante>1234567890123456789012345678901234567890123456789</claveAccesoComprobante></ec:autorizacionComprobante></soapenv:Body></soapenv:Envelope>